tap "alextall/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Decentralized dependency manager for Cocoa
brew "carthage"

# Mac App Store command-line interface
brew "mas"

# Ruby version manager
brew "rbenv"

# Formatting tool for reformatting Swift code
brew "swiftformat"

# Tool to enforce Swift style and conventions
brew "swiftlint"

# Transcode video files to lower bitrates based on resolution
brew "alextall/tools/plexify"

cask "alfred3"
cask "backblaze"
cask "blender"
cask "charles"
cask "epic-games"
cask "handbrake"
cask "hazel"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "origin"
cask "paw"
cask "plex"
cask "reveal"
cask "sketch"
cask "steam"
cask "tower"
cask "transmit"
cask "unity-hub"
cask "zeplin"

mas "1Password 7", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Base", id: 402383384
mas "BBEdit", id: 404009241
mas "Better", id: 1121192229
mas "Compressor", id: 424390742
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Jira", id: 1475897096
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Postico", id: 1031280567
mas "Screens", id: 1224268771
mas "Slack", id: 803453959
mas "Things", id: 904280696
mas "Xcode", id: 497799835
